ws-asahi/UkiUkiCore/megaavr/variants/WazamonoKunai/pins_arduino.h
/* pins_arduino.h - Variant definition for the Wazamono Kunai (AVR32DU20)
 * ---------------------------------------------------------------------------
 * Part of WazamonoCore (a product-specific fork of SpenceKonde/DxCore).
 * DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see LICENSE.md),
 * based on existing Arduino cores. This variant (C) Workshop Asahi 2026.
 *
 * Board   : Wazamono Kunai (Seeeduino XIAO form factor, AVR32DU20, USB-C)
 * MCU     : AVR32DU20  (20-pin VQFN/SSOP)
 * Clock   : internal 24 MHz OSCHF, crystal-less (boards.txt: clocksource = 0).
 *           USB CLK_USB (48 MHz) = OSCHF + PLL48M, auto-tuned to the USB SOF.
 *           PA0/PA1 therefore stay plain GPIO (D6/D7 = the Serial1 UART).
 *
 *  ===== Pin numbering: Seeeduino XIAO compatible (NONCANONICAL) =====
 *   D#   MCU   XIAO role / notes                             A#,  AIN
 *   D0   PC3   A0 | ~PWM(TCB1 via CCL LUT1, default outlet)  A0,  AIN31
 *   D1   PA7   A1 | SPI SS | AC0 OUT | EVOUTA | CLKOUT       A1,  AIN27
 *   D2   PD6   A2 | ~PWM(TCB1 via CCL LUT2 alt) | Serial2 TX  A2,  AIN6
 *   D3   PD7   A3 | Serial2 RX (USART1 ALT2) | EVOUTD        A3,  AIN7
 *   D4   PA2   A4 | SDA (TWI0 default) | ~PWM(TCA0 WO2)      A4,  AIN22
 *   D5   PA3   A5 | SCL (TWI0 default) | ~PWM(TCA0 WO3)      A5,  AIN23
 *   D6   PA0   TX (Serial1 / USART0 default) | ~PWM(WO0)     -    (no ADC)
 *   D7   PA1   RX (Serial1 / USART0 default) | ~PWM(WO1)     -    (no ADC)
 *   D8   PA6   SPI SCK                                       A8,  AIN26
 *   D9   PA5   SPI MISO | ~PWM(TCA0 WO5)                     A9,  AIN25
 *   D10  PA4   SPI MOSI | ~PWM(TCA0 WO4)                     A10, AIN24
 *   D11  PD4   LED_BUILTIN | USB-CDC TX activity LED         A11, AIN4
 *   D12  PD5   USB-CDC RX activity LED                       A12, AIN5
 *   --- not exposed as a numbered Dn (appended so the arrays are complete) ---
 *        PF6   RESET                                index 15
 *        PF7   UPDI                                 index 16  (== PIN_PF7, highest)
 *   (D13/D14 do not exist as pins: indices 13/14 are gaps, so XIAO sketches
 *    that blink the user LED "13" become harmless no-ops. The Seeeduino XIAO
 *    puts its TX LED on 11 and RX LED on 12; rev.3 follows that numbering.)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTA (WO0..WO5 = PA0..PA5 = D6,D7,D4,D5,D10,D9) : TCA0_PINS below
 *   TCB1  -> ONE waveform, TWO exclusive outlets (WAZAMONO_TCB1_PWMMUX):
 *            D0 = PC3 (LUT1-OUT, default position)  - the default outlet,
 *            D2 = PD6 (LUT2-OUT, ALT1 position).
 *           TCB1 runs in 8-bit PWM mode and its internal WO signal feeds the
 *           LUT (INSEL1 = TCB, DS40002548A 30.2.2.1); the LUT passes it to the
 *           pin. analogWrite() on either pin claims the route - the pin most
 *           recently written carries the waveform, the other returns to plain
 *           GPIO (core wazamono_lutpwm.c). Both share TCB1's frequency/duty.
 *           There is no direct WO outlet: TCB1's WO positions are PA3 (= D5,
 *           SCL, default) and PF5 (ALT1, absent on the 20-pin DU); TCB1_PINS
 *           parks it on ALT1, which is entirely harmless here.
 *   millis-> TCB0 : boards.txt passes -DMILLIS_USE_TIMERB0, so TCB1 is free.
 *   tone()-> TCB1 : Tone.cpp auto-selects TCB1 when millis is on TCB0. tone()
 *           and D0/D2 PWM share TCB1: calling tone() suspends that PWM only.
 *           Likewise, taking the LUT over (direct CCL register use) suspends
 *           the PWM on its pin: analogWrite() falls back to digital output.
 *           D2 PWM and Serial2 TX are the same pin: use one or the other.
 *   SPI0  -> DEFAULT (PA4 MOSI / PA5 MISO / PA6 SCK / PA7 SS = D10/D9/D8/D1).
 *           Board is SPI host; run with Client Select Disable (SSD=1) so D1's
 *           level cannot flip host -> client mode. D1 doubles as software CS.
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = D4/D5 = A4/A5 (XIAO I2C position).
 *   USART0-> user-facing "Serial1", DEFAULT position (PA0 TX / PA1 RX = D6/D7,
 *           the XIAO UART position). The object is Serial0; UART0.cpp emits the
 *           Serial1 alias (WAZAMONO_SERIAL1_IS_USART0).
 *   USART1-> user-facing "Serial2", ALT2 (PD6 TX / PD7 RX = D2/D3)
 *           (WAZAMONO_SERIAL2_IS_USART1; the only USART1 position on the DU).
 *   CCL   -> LUT0 is the CustomLogic user unit (IN0/IN1/IN2 = D6/D7/D4,
 *           OUT = D5, alt OUT = D8). LUT1 (-> D0) and LUT2 (ALT1 -> D2) carry
 *           TCB1 PWM (above); LUT2's input pins do not exist on the DU-20.
 *           LUT3 has no pins here.
 *   LED   -> PD4 (D11) is LED_BUILTIN and doubles as the USB-CDC TX activity
 *           LED; PD5 (D12) is the USB-CDC RX activity LED (XIAO numbering:
 *           TX = 11, RX = 12; weak hooks in usb_cdc.c, overridden in
 *           wazamono_kunai_init.cpp). Both LEDs are active-LOW (matching the
 *           bootloader's PD4 blink).
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Board identification: ARDUINO_AVR_KUNAI is THE macro that identifies this
 * board, following the Arduino convention (ARDUINO_AVR_PROMICRO, ARDUINO_UNOWIFIR4).
 * The Arduino build system defines it from boards.txt (build.board=AVR_KUNAI
 * -> -DARDUINO_AVR_KUNAI); the fallback below covers builds outside the IDE
 * (e.g. the bootloader tree, which passes it explicitly). It is used by the
 * core, the bundled libraries, the examples and the bootloader sources alike.
 * MCU identification comes from the compiler (-mmcu): __AVR_AVR32DU20__,
 * plus the core's family tags __AVR_DU__ / _AVR_FAMILY / _AVR_PINCOUNT
 * (core_devices.h).
 * DU_20PIN_PINOUT keeps DU-20 feature assumptions in the core;
 * NONCANONICAL_PIN_NUMBERS tells the core to derive (port,bit) from the tables
 * below instead of assuming pin number == port order. */
#ifndef ARDUINO_AVR_KUNAI
  #define ARDUINO_AVR_KUNAI 1
#endif
#define DU_20PIN_PINOUT
#define NONCANONICAL_PIN_NUMBERS

