ws-asahi/UkiUkiCore/megaavr/variants/WazamonoKunai/pins_arduino.h
/* ---- Digital pin number for each MCU pin (XIAO layout, D0..D10 + D13/D14) ---- */
#define PIN_PC3 (0)   // D0  A0 / ~PWM(TCB1 via CCL LUT1, default outlet)
#define PIN_PA7 (1)   // D1  A1 / SPI SS / AC0 OUT / EVOUTA / CLKOUT
#define PIN_PD6 (2)   // D2  A2 / ~PWM(TCB1 via CCL LUT2 alt) / Serial2 TX (USART1 ALT2)
#define PIN_PD7 (3)   // D3  A3 / Serial2 RX (USART1 ALT2) / EVOUTD
#define PIN_PA2 (4)   // D4  A4 / SDA (TWI0 default) / TCA0 WO2 / USART0 XCK
#define PIN_PA3 (5)   // D5  A5 / SCL (TWI0 default) / TCA0 WO3 / LUT0-OUT / USART0 XDIR
#define PIN_PA0 (6)   // D6  TX (Serial1 = USART0 default) / TCA0 WO0 / LUT0-IN0
#define PIN_PA1 (7)   // D7  RX (Serial1 = USART0 default) / TCA0 WO1 / LUT0-IN1
#define PIN_PA6 (8)   // D8  SPI SCK / LUT0-OUT (alt)
#define PIN_PA5 (9)   // D9  SPI MISO / TCA0 WO5
#define PIN_PA4 (10)  // D10 SPI MOSI / TCA0 WO4
#define PIN_PD4 (11)  // D11 LED_BUILTIN / USB-CDC TX activity LED
#define PIN_PD5 (12)  // D12 USB-CDC RX activity LED
#define PIN_PF6 (15)  // RESET
#define PIN_PF7 (16)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 17)

/* ---- Counts ---- */
#define PINS_COUNT                     (17)  // length of the pin tables (incl. reserved; 13/14 are gaps)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 17

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PD4)   // D11, on-board LED (active-LOW)
#endif
#define LED_BUILTIN_TX                 (PIN_PD4)   // D11 doubles as USB-CDC TX activity LED
#define LED_BUILTIN_RX                 (PIN_PD5)   // D12 USB-CDC RX activity LED (active-LOW)

/* ---- Event output pins: FIXED by the board's pin-configuration table ----
 * One pin per event output, no alternatives. Libraries (CustomLogic, and the
 * EventSystem library in its Wazamono form) route event outputs to these only.
 *   EVOUTA -> PA7 = D1   (PORTMUX ALT1; PA2/D4 stays I2C SDA)
 *   EVOUTD -> PD7 = D3   (PORTMUX ALT1; default PD2 does not exist on DU-20)
 *   EVOUTF -> none       (PF2 absent; PF7 alternate is the UPDI pin) */
#define WAZAMONO_EVOUTA_PIN            (PIN_PA7)
#define WAZAMONO_EVOUTA_ALT            (1)
#define WAZAMONO_EVOUTD_PIN            (PIN_PD7)
#define WAZAMONO_EVOUTD_ALT            (1)

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

/* ---- Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used) ----
 * ADC channels per DS40002576A: PA0/PA1 have no ADC input on the DU-20. */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PC3 ? 31 : (p) == PIN_PA7 ? 27 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA6 ? 26 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA4 ? 24 : (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) == 31 ? PIN_PC3 : (p) == 27 ? PIN_PA7 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 26 ? PIN_PA6 : (p) == 25 ? PIN_PA5 : \
    (p) == 24 ? PIN_PA4 : (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : NOT_A_PIN )

#define analogInputToDigitalPin(p)        analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p) <= NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN))
#define portToPinZero(port)               ((port) == PA ? PIN_PA0 : ((port) == PC ? PIN_PC3 : ((port) == PD ? PIN_PD4 : NOT_A_PIN)))

/* ---- PWM ----
 * millis lives on TCB0 (boards.txt -DMILLIS_USE_TIMERB0), leaving TCB1 free for
 * PWM and for tone(). Neither D0 (PC3) nor D2 (PD6) is a TCB WO pin: they are
 * LUT1's and LUT2's output pins, and analogWrite() delivers TCB1's 8-bit PWM
 * waveform through the LUT (see the WAZAMONO_TCB1_PWMMUX block below and
 * cores/dxcore/wazamono_lutpwm.h). ONE waveform, TWO exclusive outlets: the
 * pin most recently written with analogWrite() carries it (default D0).
 * tone(): Tone.cpp routes tone to TCB1 whenever millis is on TCB0, so tone
 * shares TCB1 with D0/D2 PWM - calling tone() suspends that PWM only.
 * TCA0 -> PORTA: WO0..WO5 = PA0..PA5 = D6,D7,D4,D5,D10,D9. */
#if defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p) (0)                   /* TCB1 is millis; no TCB PWM */
#elif defined(MILLIS_USE_TIMERB0)
  /* TCB0 = millis -> TCB1 free. ONE waveform, TWO selectable outlets:
   * D0 (LUT1 default), D2 (LUT2 alt). Exclusive - last analogWrite() wins. */
  #define digitalPinHasPWMTCB(p) ((p) == PIN_PC3 || (p) == PIN_PD6)
#else
  #define digitalPinHasPWMTCB(p) ((p) == PIN_PC3 || (p) == PIN_PD6)
#endif
#define digitalPinHasPWMTCA(p) ( \
    (p) == PIN_PA0 || (p) == PIN_PA1 || (p) == PIN_PA2 || \
    (p) == PIN_PA3 || (p) == PIN_PA4 || (p) == PIN_PA5 )

/* TCA0 routed to PORTA: WO0..WO5 = PA0..PA5 = D6,D7,D4,D5,D10,D9. */
#define TCA0_PINS                       (PORTMUX_TCA0_PORTA_gc)
#define TCB0_PINS                       (0x00)   // TCB0 = millis; WO unused (default PA2 pos)
#define TCB1_PINS                       (0x02)   // PORTMUX.TCBROUTEA bit 1: TCB1 WO parked on ALT1.
                                                 // ALT1 = PF5, which does not exist on the 20-pin DU:
                                                 // the D0 waveform travels through LUT1, and the WO
                                                 // parking spot is harmless. (DS40002548A 17.3.5)

#define PIN_TCA0_WO0_INIT               (PIN_PA0)
#define PIN_TCB0_WO_INIT                (PIN_PA2)   // TCB0 = millis; not enabled for PWM
#define PIN_TCB1_WO_INIT                (NOT_A_PIN) // parked on ALT1/PF5 (absent on DU-20); PWM leaves via LUT1/D0 or LUT2/D2

/* ---- D0 / D2 PWM: TCB1 through CCL LUT1 / LUT2 (core mechanism, wazamono_lutpwm.{h,c}) ----
 * analogWrite(D0, x) makes TCB1's PWM8 waveform reach D0 = PC3 = LUT1-OUT:
 *   TCB1 WO (internal) -> LUT1 INSEL1 = TCB -> TRUTH 0xCC -> PC3.
 * analogWrite(D2, x) does the same through LUT2 on its ALT1 output position:
 *   TCB1 WO (internal) -> LUT2 INSEL1 = TCB -> TRUTH 0xCC -> PD6
 *   (DS40002548B 17.2.2: CCLROUTEA.LUT2 = 1 -> LUT2-OUT on PD6).
 * The digital_pin_to_timer[] entries for D0 and D2 are TIMERB1, which sends
 * analogWrite() down the standard TCB path; the macros below tell the core
 * hook which LUT carries the waveform for which pin. The two outlets are
 * exclusive: engaging one releases the other (last analogWrite() wins), and
 * both share TCB1's frequency and duty. Conflicts disable analogWrite on the
 * affected pin automatically: tone()/TCB1 reconfiguration (CNTMODE check) and
 * LUT use by other code (signature check in wazamono_lutpwm.c). Neither LUT1
 * nor LUT2 is offered by the CustomLogic library on the Kunai (its user unit
 * is LUT0), so in practice only direct CCL register use competes for them.
 * D2 is also Serial2's TX pin (USART1 ALT2): while Serial2 is active the USART
 * drives PD6, so D2 PWM and Serial2 are alternatives, not companions.
 * There is no direct WO outlet (TCB1 WO = PA3/SCL or PF5/absent), so
 * WAZAMONO_TCB1_PWM_WO_PIN is left undefined; the core drops that path.
 * CCMPEN therefore stays 0: the CCL taps the internal WO signal, which was
 * measured on silicon to run regardless of that bit (see wazamono_lutpwm.h).
 * The LUT1 -> PC3 path was part of that measurement; the LUT2 ALT1 -> PD6
 * path uses identical LUT bytes and differs only in CCLROUTEA. */
#define WAZAMONO_TCB1_PWMMUX            (1)         /* exclusive D0/D2 routing (default D0) */
#define WAZAMONO_TCB1_PWM_LUT0_PIN      (PIN_PC3)   /* outlet A = D0: LUT1-OUT, default position */
#define WAZAMONO_TCB1_PWM_LUT0          (1)         /*   (LUT index 1) */
#define WAZAMONO_TCB1_PWM_LUT0_ALT      (0)
#define WAZAMONO_TCB1_PWM_LUT1_PIN      (PIN_PD6)   /* outlet B = D2: LUT2-OUT, ALT1 position */
#define WAZAMONO_TCB1_PWM_LUT1          (2)         /*   (LUT index 2) */
#define WAZAMONO_TCB1_PWM_LUT1_ALT      (1)
/* WAZAMONO_TCB1_PWM_WO_PIN intentionally undefined: no direct WO outlet. */

