ws-asahi/UkiUkiCore/megaavr/variants/WazamonoKunai/pins_arduino.h
#define digitalPinHasPWM(p)             (digitalPinHasPWMTCB(p) || digitalPinHasPWMTCA(p))

/* ---- SPI (host; chip-selects are user GPIO). Kunai uses the DEFAULT position ---- */
#define SPI_INTERFACES_COUNT            (1)
#define SPI_MUX                         (PORTMUX_SPI0_DEFAULT_gc)  // PA4/PA5/PA6
#define SPI_MUX_PINSWAP_NONE            (PORTMUX_SPI0_NONE_gc)
#define PIN_SPI_MOSI                    (PIN_PA4)   // D10
#define PIN_SPI_MISO                    (PIN_PA5)   // D9
#define PIN_SPI_SCK                     (PIN_PA6)   // D8
#define PIN_SPI_SS                      (PIN_PA7)   // D1 (hardware SS position; host mode + SSD=1, software CS)
#define PIN_SPI_SS_HARDWARE             (PIN_PA7)   // the DEFAULT-position SS pin itself (client mode / SPISlave)

/* ---- TWI 0 (I2C on A4/A5 = D4/D5, XIAO convention; TWI0 DEFAULT position) ---- */
#define PIN_WIRE_SDA                    (PIN_PA2)   // D4 / A4
#define PIN_WIRE_SCL                    (PIN_PA3)   // D5 / A5
#define PIN_WIRE_SDA_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SCL_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SDA_PINSWAP_3          (NOT_A_PIN)
#define PIN_WIRE_SCL_PINSWAP_3          (NOT_A_PIN)

/* ---- USART0 -> user-facing "Serial1" = the XIAO D6/D7 UART. DEFAULT position
 * (PA0 TX / PA1 RX; the chip is crystal-less, so PA0/PA1 are free for it).
 * The object is Serial0; UART0.cpp emits the Serial1 alias. ---- */
#ifndef WAZAMONO_SERIAL1_IS_USART0
  #define WAZAMONO_SERIAL1_IS_USART0
#endif
#define HWSERIAL0_MUX                   (0x00 /* PORTMUX_USART0_DEFAULT_gc - PA0/PA1 = D6/D7 */)
#define HWSERIAL0_MUX_PINSWAP_1         (0x01 /* PORTMUX_USART0_ALT1_gc - PA4..PA7 (= SPI) */)
#define HWSERIAL0_MUX_PINSWAP_2         (0x02 /* PORTMUX_USART0_ALT2_gc - PA2/PA3 (= I2C) */)
#define HWSERIAL0_MUX_PINSWAP_3         (0x03 /* PORTMUX_USART0_ALT3_gc - PD4..PD7 (= LEDs/Serial2) */)
#define HWSERIAL0_MUX_PINSWAP_NONE      (0x05)
#define HWSERIAL0_MUX_DEFAULT          (0)   /* Kunai default: USART0 DEFAULT (PA0/PA1 = D6/D7). */
#define PIN_HWSERIAL0_TX                (PIN_PA0)
#define PIN_HWSERIAL0_RX                (PIN_PA1)
#define PIN_HWSERIAL0_XCK               (PIN_PA2)
#define PIN_HWSERIAL0_XDIR              (PIN_PA3)
#define PIN_HWSERIAL0_TX_PINSWAP_1      (PIN_PA4)
#define PIN_HWSERIAL0_RX_PINSWAP_1      (PIN_PA5)
#define PIN_HWSERIAL0_XCK_PINSWAP_1     (PIN_PA6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    (PIN_PA7)
#define PIN_HWSERIAL0_TX_PINSWAP_2      (PIN_PA2)
#define PIN_HWSERIAL0_RX_PINSWAP_2      (PIN_PA3)
#define PIN_HWSERIAL0_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL0_XDIR_PINSWAP_2    (NOT_A_PIN)
#define PIN_HWSERIAL0_TX_PINSWAP_3      (PIN_PD4)
#define PIN_HWSERIAL0_RX_PINSWAP_3      (PIN_PD5)
#define PIN_HWSERIAL0_XCK_PINSWAP_3     (PIN_PD6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_3    (PIN_PD7)

/* ---- USART1 -> user-facing "Serial2" on D2/D3 (ALT2 = PD6/PD7, the only
 * USART1 pin position on the DU). The object is Serial1; UART1.cpp renames it
 * to Serial2 (WAZAMONO_SERIAL2_IS_USART1). ---- */
#ifndef WAZAMONO_SERIAL2_IS_USART1
  #define WAZAMONO_SERIAL2_IS_USART1
#endif
#define HWSERIAL1_MUX                   (0x00 /* PORTMUX_USART1_DEFAULT_gc - no pins */)
#define HWSERIAL1_MUX_PINSWAP_1         (0x01 << 3 /* ALT1 absent on DU - placeholder */)
#define HWSERIAL1_MUX_PINSWAP_2         (0x02 << 3 /* PORTMUX_USART1_ALT2_gc - PD6/PD7 = D2/D3 */)
#define HWSERIAL1_MUX_PINSWAP_NONE      (0x03 << 3)
#define HWSERIAL1_MUX_DEFAULT          (2)   /* Kunai default: USART1 ALT2 (PD6/PD7 = D2/D3) */
#define PIN_HWSERIAL1_TX                (NOT_A_PIN)
#define PIN_HWSERIAL1_RX                (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK               (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR              (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_RX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK_PINSWAP_1     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_1    (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_2      (PIN_PD6)
#define PIN_HWSERIAL1_RX_PINSWAP_2      (PIN_PD7)
#define PIN_HWSERIAL1_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_2    (NOT_A_PIN)

/* ---- Arduino analog aliases. XIAO header = A0..A10 (A6/A7 skipped: PA0/PA1
 * have no ADC); the LED pins are also reachable as A11/A12. ---- */
#define PIN_A0   (PIN_PC3)   // D0
#define PIN_A1   (PIN_PA7)   // D1
#define PIN_A2   (PIN_PD6)   // D2
#define PIN_A3   (PIN_PD7)   // D3
#define PIN_A4   (PIN_PA2)   // D4   SDA
#define PIN_A5   (PIN_PA3)   // D5   SCL
#define PIN_A8   (PIN_PA6)   // D8
#define PIN_A9   (PIN_PA5)   // D9
#define PIN_A10  (PIN_PA4)   // D10
#define PIN_A11  (PIN_PD4)   // D11  LED_BUILTIN
#define PIN_A12  (PIN_PD5)   // D12

/* --- XIAO style number-prefixed digital pin aliases (D0..D12 contiguous) ---
 * D-number == Arduino digital pin number. Internal-only pins (PF6 RESET,
 * PF7 UPDI) are intentionally NOT exposed as Dn. D13/D14 do not exist. */
#undef D0
#undef D1
#undef D2
#undef D3
#undef D4
#undef D5
#undef D6
#undef D7
#undef D8
#undef D9
#undef D10
#undef D11
#undef D12
static const uint8_t D0  = PIN_PC3;  // A0 / ~PWM(TCB1 via CCL LUT1)
static const uint8_t D1  = PIN_PA7;  // A1 / SS
static const uint8_t D2  = PIN_PD6;  // A2 / ~PWM(TCB1 via CCL LUT2 alt, exclusive with D0) / Serial2 TX
static const uint8_t D3  = PIN_PD7;  // A3 / Serial2 RX
static const uint8_t D4  = PIN_PA2;  // A4 / SDA
static const uint8_t D5  = PIN_PA3;  // A5 / SCL
static const uint8_t D6  = PIN_PA0;  // TX (Serial1)
static const uint8_t D7  = PIN_PA1;  // RX (Serial1)
static const uint8_t D8  = PIN_PA6;  // SCK
static const uint8_t D9  = PIN_PA5;  // MISO
static const uint8_t D10 = PIN_PA4;  // MOSI
static const uint8_t D11 = PIN_PD4;  // LED_BUILTIN / USB-CDC TX activity LED
static const uint8_t D12 = PIN_PD5;  // USB-CDC RX activity LED

static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A4   = PIN_A4;
static const uint8_t A5   = PIN_A5;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;
static const uint8_t A11  = PIN_A11;
static const uint8_t A12  = PIN_A12;

