ws-asahi/UkiUkiCore/megaavr/variants/WazamonoKunai/pins_arduino.h
/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag). */
#define AIN4   ADC_CH(4)
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN7   ADC_CH(7)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

/* ---- Pin arrays (ARDUINO_MAIN). Indexed by digital pin number (0..16).
 * Indices 13 and 14 are gaps (NOT_A_PIN / NOT_A_PORT): the XIAO's "13" user
 * LED has no counterpart here, so digitalWrite(13, ...) is a harmless no-op. ---- */
#ifdef ARDUINO_MAIN
  const uint8_t digital_pin_to_port[] = {
    PC,         //  0 PC3  D0  A0 / TCB1 PWM via CCL LUT1
    PA,         //  1 PA7  D1  A1 / SS / AC0 OUT / EVOUTA
    PD,         //  2 PD6  D2  A2 / TCB1 PWM via CCL LUT2 (alt) / Serial2 TX
    PD,         //  3 PD7  D3  A3 / Serial2 RX / EVOUTD
    PA,         //  4 PA2  D4  A4 / SDA / TCA0 WO2
    PA,         //  5 PA3  D5  A5 / SCL / TCA0 WO3
    PA,         //  6 PA0  D6  TX / TCA0 WO0
    PA,         //  7 PA1  D7  RX / TCA0 WO1
    PA,         //  8 PA6  D8  SCK
    PA,         //  9 PA5  D9  MISO / TCA0 WO5
    PA,         // 10 PA4  D10 MOSI / TCA0 WO4
    PD,         // 11 PD4  D11 LED_BUILTIN / CDC TX LED
    PD,         // 12 PD5  D12 CDC RX LED
    NOT_A_PORT, // 13 (gap - no D13; XIAO user-LED writes become no-ops)
    NOT_A_PORT, // 14 (gap)
    PF,         // 15 PF6  RESET
    PF          // 16 PF7  UPDI
  };

  const uint8_t digital_pin_to_bit_position[] = {
    PIN3_bp,   //  0 PC3  D0
    PIN7_bp,   //  1 PA7  D1
    PIN6_bp,   //  2 PD6  D2
    PIN7_bp,   //  3 PD7  D3
    PIN2_bp,   //  4 PA2  D4
    PIN3_bp,   //  5 PA3  D5
    PIN0_bp,   //  6 PA0  D6
    PIN1_bp,   //  7 PA1  D7
    PIN6_bp,   //  8 PA6  D8
    PIN5_bp,   //  9 PA5  D9
    PIN4_bp,   // 10 PA4  D10
    PIN4_bp,   // 11 PD4  D11
    PIN5_bp,   // 12 PD5  D12
    NOT_A_PIN, // 13 (gap)
    NOT_A_PIN, // 14 (gap)
    PIN6_bp,   // 15 PF6  RESET
    PIN7_bp    // 16 PF7  UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN3_bm,   //  0 PC3  D0
    PIN7_bm,   //  1 PA7  D1
    PIN6_bm,   //  2 PD6  D2
    PIN7_bm,   //  3 PD7  D3
    PIN2_bm,   //  4 PA2  D4
    PIN3_bm,   //  5 PA3  D5
    PIN0_bm,   //  6 PA0  D6
    PIN1_bm,   //  7 PA1  D7
    PIN6_bm,   //  8 PA6  D8
    PIN5_bm,   //  9 PA5  D9
    PIN4_bm,   // 10 PA4  D10
    PIN4_bm,   // 11 PD4  D11
    PIN5_bm,   // 12 PD5  D12
    NOT_A_PIN, // 13 (gap)
    NOT_A_PIN, // 14 (gap)
    PIN6_bm,   // 15 PF6  RESET
    PIN7_bm    // 16 PF7  UPDI
  };

  /* TCA0 PWM is resolved dynamically from PORTMUX, so TCA0 pins are NOT_ON_TIMER
   * here. D0 (PC3) and D2 (PD6) are marked TIMERB1: they carry TCB1's PWM
   * through CCL LUT1 / LUT2 (see WAZAMONO_TCB1_PWMMUX above). millis = TCB0. */
  const uint8_t digital_pin_to_timer[] = {
    TIMERB1,      //  0 PC3  D0  (TCB1 PWM via CCL LUT1 - default outlet)
    NOT_ON_TIMER, //  1 PA7  D1
    TIMERB1,      //  2 PD6  D2  (TCB1 PWM via CCL LUT2 alt - exclusive with D0)
    NOT_ON_TIMER, //  3 PD7  D3
    NOT_ON_TIMER, //  4 PA2  D4  (TCA0 WO2, dynamic; TCB0 WO = millis)
    NOT_ON_TIMER, //  5 PA3  D5  (TCA0 WO3, dynamic)
    NOT_ON_TIMER, //  6 PA0  D6  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  7 PA1  D7  (TCA0 WO1, dynamic)
    NOT_ON_TIMER, //  8 PA6  D8
    NOT_ON_TIMER, //  9 PA5  D9  (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 10 PA4  D10 (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 11 PD4  D11
    NOT_ON_TIMER, // 12 PD5  D12
    NOT_ON_TIMER, // 13 (gap)
    NOT_ON_TIMER, // 14 (gap)
    NOT_ON_TIMER, // 15 PF6  RESET
    NOT_ON_TIMER  // 16 PF7  UPDI
  };
#endif

/* =================================================================
 *  USB identity   (AVR DU = USB-native part, treated like the 32U4)
 * =================================================================
 *  USBCON enables Arduino's HID / Keyboard / Mouse / etc. on this board.
 *  NOTE: the native USB-CDC descriptor's VID/PID/product string are taken
 *  from cores/dxcore/usb_descriptors.{h,c} (which does NOT include this
 *  file), so the values below are informational only - keep them in sync.
 *  Effective app identity: 0x1209:0x000A, product "Wazamono Kunai".
 *  Obtain a real product VID/PID before release (pid.codes = dev only).
 */
#ifndef USBCON
  #define USBCON
#endif
#ifndef USB_VID
  #define USB_VID                0x1209
#endif
#ifndef USB_PID
  #define USB_PID                0x000A
#endif
#ifndef USB_MANUFACTURER
  #define USB_MANUFACTURER       "Workshop Asahi"
#endif
#ifndef USB_PRODUCT
  #define USB_PRODUCT            "Wazamono Kunai"
#endif

/* =================================================================
 *  Serial -> native USB CDC   (Leonardo/Micro convention)
 * =================================================================
 *  Serial  = USBSerial (on-chip USB CDC)              <- primary / USB serial monitor
 *  Serial1 = USART0   (D6 TX / D7 RX - the XIAO UART position; Uno R4-style
 *                      naming. Alias of Serial0 - both names reach the port.)
 *  Serial2 = USART1   (D2 TX / D3 RX, ALT2 - the DU's only USART1 position.)
 *  Define HAVE_NO_USB_SERIAL_REDIRECT (from boards.txt) to keep Serial==USART0.
 */
#if defined(USB0) && !defined(HAVE_NO_USB_SERIAL_REDIRECT)
  #ifndef Serial
    #define Serial                  USBSerial   /* Serial = native USB CDC   */
  #endif
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR     Serial
  #endif
  #ifndef SERIAL_PORT_USBVIRTUAL
    #define SERIAL_PORT_USBVIRTUAL  Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE    Serial1     /* XIAO D6/D7 hardware UART (USART0) */
  #endif
  #ifndef SERIAL_PORT_HARDWARE_OPEN
    #define SERIAL_PORT_HARDWARE_OPEN  Serial2  /* free hardware UART on D2/D3 (USART1) */
  #endif
#endif

/* ---- analogReference(): EXTERNAL disabled on Kunai ----
 * PD7 (the VREFA pin) is repurposed as D3 (Serial2 RX / EVOUTD), so there is
 * no external reference input. Undefining EXTERNAL turns analogReference(
 * EXTERNAL) into a compile error, steering sketches to the internal references
 * (1.024/2.048/2.5/4.096 V) or VDD. (Included from Arduino.h AFTER EXTERNAL
 * is defined.) */
#ifdef EXTERNAL
  #undef EXTERNAL
#endif

#endif
